todo_api/app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "content", "datetime", "complete_flag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "hanakuso"], ["content", nil], ["datetime", nil], ["complete_flag", nil], ["created_at", "2024-07-17 09:10:17.751682"], ["updated_at", "2024-07-17 09:10:17.751682"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "datetime" = ?, "complete_flag" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["datetime", nil], ["complete_flag", 0], ["updated_at", "2024-07-18 07:04:26.446160"], ["id", 4]]